InformationRegisters/КомментарииФайловДокументовКЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КомментарииФайловДокументовКЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКомментария</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайлПечатнойФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗапланированныеДействияСФайламиДокументовКЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗапланированныеДействияСФайламиДокументовКЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаетПодписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайлПечатнойФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСФайламиДокументовКЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДействияСФайламиДокументовКЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ДействияСФайламиДокументовКЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПоПочте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьВКабинетСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаРаботаВРоссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьНаДиск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомиться</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КомментарииФайловДокументовКЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция КомментарииФайла(ЭлектронныйДокумент) Экспорт
	
	Комментарии = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомментарииФайловДокументовКЭДО.Исполнитель КАК Исполнитель,
		|	КомментарииФайловДокументовКЭДО.ДатаКомментария КАК ДатаКомментария,
		|	КомментарииФайловДокументовКЭДО.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА ЗапланированныеДействияСФайламиДокументовКЭДО.ПрисоединенныйФайл ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Ознакомиться
		|ИЗ
		|	РегистрСведений.КомментарииФайловДокументовКЭДО КАК КомментарииФайловДокументовКЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗапланированныеДействияСФайламиДокументовКЭДО КАК ЗапланированныеДействияСФайламиДокументовКЭДО
		|		ПО КомментарииФайловДокументовКЭДО.ПрисоединенныйФайл = ЗапланированныеДействияСФайламиДокументовКЭДО.ПрисоединенныйФайл
		|			И (ЗапланированныеДействияСФайламиДокументовКЭДО.Исполнитель = &ТекущийПользователь)
		|			И (ЗапланированныеДействияСФайламиДокументовКЭДО.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСФайламиДокументовКЭДО.Ознакомиться))
		|ГДЕ
		|	КомментарииФайловДокументовКЭДО.ПрисоединенныйФайл = &ПрисоединенныйФайл
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаКомментария,
		|	Исполнитель,
		|	Комментарий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Комментарий = Новый Структура("Исполнитель,ДатаКомментария,Комментарий,Ознакомиться");
		ЗаполнитьЗначенияСвойств(Комментарий, Выборка);
		
		Комментарии.Добавить(Комментарий);
		
	КонецЦикла;
	
	Возврат Комментарии;
	
КонецФункции

#КонецОбласти

#КонецЕсли
